---
title: "verbose flag"
date: 2020-07-01T15:34:29+77:00
draft: false
weight: 750

---

##### You can use different verbose level as a flag for debugging and reveal the information you would like to trace

This showcases that the dvar's rendered result will be printed out with that flagged verbose level

For example, if the set flag is vvv, then when you run below command with verbose level vvv, the result will be printed

```
up task -d ./tests/functests -t $1 -i dev -v vvvv --configdir=./tests/functests
```


### Demo








[source](https://github.com/upcmd/up/blob/master/tests/functests/c0065.yml)

##### Main task yaml file
```
    docs: ""
    vars:
      person: peter
      managers:
      - tom
      - jason
      - alice
    dvars:
    - name: var_with_range_v
      value: "{{range .managers}} x {{end}}"
      flags: [v]
    - name: var_with_range_vv
      value: "{{range .managers}} x {{end}}"
      flags: [vv]
    - name: var_with_range_vvv
      value: "{{range .managers}} x {{end}}"
      flags: [vvv]
    - name: var_with_range_vvvv
      value: "{{range .managers}} x {{end}}"
      flags: [vvvv]
    - name: var_with_range_vvvvv
      value: "{{range .managers}} x {{end}}"
      flags: [vvvvv]
    - name: var_with_range_vvvvvv
      value: "{{range .managers}} x {{end}}"
      flags: [vvvvvvv]
    tasks:
    - name: task
      task:
    
```
##### Main log file
```
    loading [Config]:  ./tests/functests/upconfig.yml
    Main config:
                 Version -> 1.0.0
                  RefDir -> ./tests/functests
                 WorkDir -> cwd
              AbsWorkDir -> /up_project/up
                TaskFile -> c0065
                 Verbose -> vvv
              ModuleName -> adoring_archimedes5
               ShellType -> /bin/sh
           MaxCallLayers -> 8
     MaxModuelCallLayers -> 256
    work dir: /up_project/up
    -exec task: task
    loading [Task]:  ./tests/functests/c0065
    module: [adoring_archimedes5] instance id: [dev]
    dvar> var_with_range_v:
    " x  x  x "
    
    dvar> var_with_range_vv:
    " x  x  x "
    
    dvar> var_with_range_vvv:
    " x  x  x "
    
    dvar> var_with_range_vvvv:
    " x  x  x "
    
    dvar> var_with_range_vvvvv:
    " x  x  x "
    
    dvar> var_with_range_vvvvv:
    " x  x  x "
    
    Task1: [task ==> task:  ]
    
```


##### Logs with different verbose level
* [c0065 log - verbose level v](../../logs/c0065_v)
* [c0065 log - verbose level vv](../../logs/c0065_vv)
* [c0065 log - verbose level vvv](../../logs/c0065_vvvv)
* [c0065 log - verbose level vvvv](../../logs/c0065_vvvv)
* [c0065 log - verbose level vvvvv](../../logs/c0065_vvvvv)

##### Raw logs with different verbose level
* [c0065 raw log - verbose level v](../../reflogs/c0065_v.log)
* [c0065 raw log - verbose level vv](../../reflogs/c0065_vv.log)
* [c0065 raw log - verbose level vvv](../../reflogs/c0065_vvv.log)
* [c0065 raw log - verbose level vvvv](../../reflogs/c0065_vvvv.log)
* [c0065 raw log - verbose level vvvvv](../../reflogs/c0065_vvvvv.log)







