---
title: "c0039_vvv"
date: 2020-07-01T15:34:26+77:00
draft: false
weight: 10392

---

### Log reference: <no value>

```
    loading [Config]:  ./tests/functests/upconfig.yml
    Main config:
                 Version -> 1.0.0
                  RefDir -> ./tests/functests
                 WorkDir -> cwd
              AbsWorkDir -> /up_project/up
                TaskFile -> c0039
                 Verbose -> vvv
              ModuleName -> elegant_hawking3
               ShellType -> /bin/sh
           MaxCallLayers -> 8
     MaxModuelCallLayers -> 256
    work dir: /up_project/up
    -exec task: task
    loading [Task]:  ./tests/functests/c0039
    module: [elegant_hawking3] instance id: [dev]
    dvar> usage_of_with:
    "  student name: Tom\n  school name: Sydney Grammar\n  Male\n  "
    
    dvar> usage_of_with_else:
    "  i am somebody  "
    
    dvar> template_def_plain:
    "\n\n\nONE TWO\"\n"
    
    dvar> template_def_consume:
    "\nshow example of how you can define reusable template\nand how you can pass in the parameters\n\n\n\n\nstudent:\n  name: ONE: Tom\n  gender: TWO: Male\n"
    
          template rendering problem -> template: .:4:11: executing "." at <{{template "T3" .student}}>: template "T3" not defined
    WARN:
        1:{{.template_def_consume_dynamic_t1}}
        2:{{.template_def_consume_dynamic_t2}}
        3:{{.template_def_consume_dynamic_t3}}
        4:{{template "T3" .student}}
        5:
        6:
    
    -----trace for reference-----
    dvar> template_def_consume_dynamic:
    "\n\n\n\nstudent:\n  name: ONE: Tom\n  gender: TWO: Male\n\n"
    
    dvar> template_use_block:
    "\n\nstudent:\n  name: ONE: Tom\ngender: TWO: Male\n\n"
    
    Task1: [task ==> task:  ]
    -Step1:
    elegant_hawking3: overall final exec vars:
    
    (*core.Cache)({
      "template_use_block": "\n\nstudent:\n  name: ONE: Tom\ngender: TWO: Male\n\n",
      "ns": "prod",
      "age": 34,
      "nobody": <nil>,
      "template_def_consume_dynamic_t1": "{{define \"T1\"}}ONE: {{.}}{{end}}\n",
      "template_def_consume_dynamic": "\n\n\n\nstudent:\n  name: ONE: Tom\n  gender: TWO: Male\n\n",
      "managers": {
        "tom",
        "jason",
        "alice"
      },
      "template_def_consume_dynamic_t3": "{{define \"T3\"}}student:\n  name: {{template \"T1\" .name}}\n  gender: {{template \"T2\" .gender}}{{end}}\n{{template \"T3\" .student}}\n",
      "old": 54,
      "admins": {
        "tom",
        "jason",
        "alice"
      },
      "template_def_consume_dynamic_main": "{{.template_def_consume_dynamic_t1}}\n{{.template_def_consume_dynamic_t2}}\n{{.template_def_consume_dynamic_t3}}\n{{template \"T3\" .student}}\n",
      "template_def_consume": "\nshow example of how you can define reusable template\nand how you can pass in the parameters\n\n\n\n\nstudent:\n  name: ONE: Tom\n  gender: TWO: Male\n",
      "template_def_consume_dynamic_t2": "{{define \"T2\"}}TWO: {{.}}{{end}}",
      "student": {
        "address": {
          "school": "Sydney Grammar",
          "suburb": {
            "postcode": 2000,
            "cbd": true,
            "name": "sydney"
          }
        },
        "name": "Tom",
        "gender": "Male",
        "teachers": {
          "tom",
          "jason",
          "alice"
        }
      },
      "pod_name": "web_app",
      "ha": true,
      "usage_of_with": "  student name: Tom\n  school name: Sydney Grammar\n  Male\n  ",
      "template_def_plain": "\n\n\nONE TWO\"\n",
      "usage_of_with_else": "  i am somebody  "
    })
    
    cmd( 1):
    echo "value\n {{.usage_of_with}}"
    
    value\n   student name: Tom
      school name: Sydney Grammar
      Male
     .. ok
    cmd( 2):
    echo "{{.usage_of_template}}"
    
    <no value>
     .. ok
    cmd( 3):
    echo "{{.template_def_consume}}"
    
    show example of how you can define reusable template
    and how you can pass in the parameters
    
    
    
    
    student:
      name: ONE: Tom
      gender: TWO: Male
     .. ok
    cmd( 4):
    echo "{{.template_def_consume_dynamic_t1}}"
    
    {{define T1}}ONE: {{.}}{{end}}
     .. ok
    cmd( 5):
    echo "{{.template_def_consume_dynamic_t2}}"
    
    {{define T2}}TWO: {{.}}{{end}}
     .. ok
    cmd( 6):
    echo "{{.template_def_consume_dynamic_t3}}"
    
    {{define T3}}student:
      name: {{template T1 .name}}
      gender: {{template T2 .gender}}{{end}}
    {{template T3 .student}}
     .. ok
    cmd( 7):
    echo "{{.template_def_consume_dynamic}}"
    
    student:
      name: ONE: Tom
      gender: TWO: Male
     .. ok
    cmd( 8):
    echo "{{.template_use_block}}"
    
    student:
      name: ONE: Tom
    gender: TWO: Male
     .. ok
    . ok
    
```

##### Logs with different verbose level
* [c0039 log - verbose level v](../../logs/c0039_v)
* [c0039 log - verbose level vv](../../logs/c0039_vv)
* [c0039 log - verbose level vvv](../../logs/c0039_vvv)
* [c0039 log - verbose level vvvv](../../logs/c0039_vvvv)
* [c0039 log - verbose level vvvvv](../../logs/c0039_vvvvv)

##### References
* [Related Chapter](../../template/c0039)
