---
title: "c0054_v"
date: 2020-10-07T00:11:09+1010:00
draft: false
weight: 10540

---

### Log reference: <no value>

```
    loading [Config]:  ./tests/functests/upconfig.yml
    Main config:
                 Version -> 1.0.0
                  RefDir -> ./tests/functests
                 WorkDir -> cwd
              AbsWorkDir -> /up_project/up
                TaskFile -> c0054
                 Verbose -> v
              ModuleName -> self
               ShellType -> /bin/sh
           MaxCallLayers -> 8
                 Timeout -> 3600000
     MaxModuelCallLayers -> 256
               EntryTask -> task
      ModRepoUsernameRef -> 
      ModRepoPasswordRef -> 
    work dir: /up_project/up
    -exec task: task
    loading [Task]:  ./tests/functests/c0054
    module: [self], instance id: [dev], exec profile: []
    Task1: [task ==> task:  ]
    -Step1:
    cmd( 1):
    -
    hello, world
    
    -
     .. ok
    . ok
    -Step2:
    -Step3:
    -Step4: [
    note that for one step, there will be only one
    return, which will be the last do cmd
    in this case, since the step3 exit code is 0
    the whole step will have the return code of 0
    if you need to use the exit code of the step
    you need to consider to reduce the number of do cmds
    or put it to last step, this is not a bug
    this is a feature
    ]
    cmd( 1):
    -
    step1
    
    -
     .. ok
    cmd( 2):
    -
    
    -
     .. failed(suppressed if it is not the last step)
    cmd( 3):
    -
    step3
    
    -
     .. ok
    . ok
    -Step5:
    cmd( 1):
    -
    hello, world
    
    -
     .. ok
    . ok
    -Step6:
    dvar> last_task_succeeded:
    "true"
    
    -
    true
    cmd( 1):
    -
    check last step
    
    -
     .. ok
    cmd( 2):
    -
    {Cmd:echo "hello, world",Code:0,Output:hello, world,ErrMsg:}
    
    -
     .. ok
    cmd( 3):
    -
    {
      Cmd: echo "hello, world",
      Code: 0,
      Output: hello, world,
      ErrMsg: 
    }
    
    -
     .. ok
    cmd( 4):
    -
    true
    
    -
     .. ok
    . ok
    -Step7:
    cmd( 1):
    -
    step1
    
    -
     .. ok
    cmd( 2):
    -
    
    -
     .. failed(suppressed if it is not the last step)
     WARN: [ignoreError:] - [Error ignored!!!]
    -Step8:
    -Step9:
    dvar> condition:
    "true"
    
    -
    true
    cmd( 1):
    -
    simple dvar as condition
    
    -
     .. ok
    . ok
    -Step10:
    dvar> condition:
    "true"
    
    -
    true
    cmd( 1):
    -
    complicated dvar evaluation as condition
    
    -
     .. ok
    . ok
    -Step11:
    dvar> condition:
    "true"
    
    -
    true
    cmd( 1):
    -
    a even more complicated condition but more readable
    
    -
     .. ok
    . ok
    -Step12:
    cmd( 1):
    -
    a complicated condition without dvar
    
    -
     .. ok
    . ok
    -Step13: [
    show that complicated arg needs to be quoted using ()
    otherwise it will cause gt to be confused
    ]
    ~SubStep1: [print:  ]
    true
    -Step14:
    ~SubStep1: [print:  ]
    true
    
```

##### Logs with different verbose level
* [c0054 log - verbose level v](../../logs/c0054_v)
* [c0054 log - verbose level vv](../../logs/c0054_vv)
* [c0054 log - verbose level vvv](../../logs/c0054_vvv)
* [c0054 log - verbose level vvvv](../../logs/c0054_vvvv)
* [c0054 log - verbose level vvvvv](../../logs/c0054_vvvvv)

##### References
* [Related Chapter](../../flow-controll/c0054)
