---
title: "c0086_vv"
date: 2020-06-27T03:09:25+66:00
draft: false
weight: 10861

---

### Log reference: <no value>

```
    loading [Config]:  ./tests/functests/upconfig.yml
    Main config:
                 Version -> 1.0.0
                  RefDir -> ./tests/functests
                 WorkDir -> cwd
              AbsWorkDir -> /up_project/up
                TaskFile -> c0086
                 Verbose -> vv
              ModuleName -> boring_babbage0
               ShellType -> /bin/sh
           MaxCallLayers -> 8
     MaxModuelCallLayers -> 256
    work dir: /up_project/up
    -exec task: task
    loading [Task]:  ./tests/functests/c0086
    module: [boring_babbage0] instance id: [dev]
    Task1: [task ==> task: generate logs ]
    -Step1:
    dvar> linelist:
    ""
    
    cmd( 1):
    echo '{{.lines}}'
    
    hello
    this
    is a
    beautiful world
     .. ok
    cmd( 2):
    echo '{{.linelist}}'
    
    <no value>
     .. ok
    cmd( 3):
    echo '{{.linelist_object}}'
    
    <no value>
     .. ok
    . ok
    -Step2:
    dvar> void:
    ""
    
    cmd( 1):
    echo '{{.lines}}'
    
    hello
    this
    is a
    beautiful world
     .. ok
    cmd( 2):
    echo '{{.linelist}}'
    
    <no value>
     .. ok
    cmd( 3):
    echo '{{.linelist_object}}'
    
    [hello this is a beautiful world]
     .. ok
    . ok
    -Step3:
    dvar> void:
    ""
    
    cmd( 1):
    echo '{{.lines}}'
    
    hello
    this
    is a
    beautiful world
     .. ok
    cmd( 2):
    echo '{{.linelist}}'
    
    <no value>
     .. ok
    cmd( 3):
    echo '{{.linelist_object}}'
    
    [hello this is a beautiful world]
     .. ok
    . ok
    -Step4:
    cmd( 1):
    echo '{{.lines}}'
    
    hello
    this
    is a
    beautiful world
     .. ok
    cmd( 2):
    echo '{{.linelist}}'
    
    <no value>
     .. ok
    cmd( 3):
    echo '{{.linelist_object}}'
    
    [hello this is a beautiful world]
     .. ok
    . ok
    -Step5:
    dvar> void:
    "person:\n  name: tom\n  age: \"18\""
    
     WARN: [?reg a void] - [you can't register a object with void name, use a proper name instead or split to multiple steps]
    dvar> void_object:
    {
      "person": {
        "name": "tom",
        "age": "18"
      }
    }
    
     WARN: [shell] - [Not implemented or void for no action!]
    . ok
    
```

##### Logs with different verbose level
* [c0086 log - verbose level v](../../logs/c0086_v)
* [c0086 log - verbose level vv](../../logs/c0086_vv)
* [c0086 log - verbose level vvv](../../logs/c0086_vvv)
* [c0086 log - verbose level vvvv](../../logs/c0086_vvvv)
* [c0086 log - verbose level vvvvv](../../logs/c0086_vvvvv)

##### References
* [Related Chapter](../../dvars/c0086)
