---
title: "c0086_v"
date: 2020-09-18T01:27:35+99:00
draft: false
weight: 10860

---

### Log reference: <no value>

```
    loading [Config]:  ./tests/functests/upconfig.yml
    Main config:
                 Version -> 1.0.0
                  RefDir -> ./tests/functests
                 WorkDir -> cwd
              AbsWorkDir -> /up_project/up
                TaskFile -> c0086
                 Verbose -> v
              ModuleName -> self
               ShellType -> /bin/sh
           MaxCallLayers -> 8
                 Timeout -> 3600000
     MaxModuelCallLayers -> 256
               EntryTask -> task
    work dir: /up_project/up
    -exec task: task
    loading [Task]:  ./tests/functests/c0086
    module: [self], instance id: [dev], exec profile: []
    Task1: [task ==> task: generate logs ]
    -Step1:
    dvar> linelist:
    "- hello\n- this\n- is a\n- beautiful world\n"
    
    -
    - hello
    - this
    - is a
    - beautiful world
    
    cmd( 1):
    -
    hello
    this
    is a
    beautiful world
    
    -
     .. ok
    cmd( 2):
    -
    - hello
    - this
    - is a
    - beautiful world
    
    
    -
     .. ok
    cmd( 3):
    -
    [hello this is a beautiful world]
    
    -
     .. ok
    . ok
    -Step2:
    dvar> void:
    "- hello\n- this\n- is a\n- beautiful world\n"
    
    -
    - hello
    - this
    - is a
    - beautiful world
    
    cmd( 1):
    -
    hello
    this
    is a
    beautiful world
    
    -
     .. ok
    cmd( 2):
    -
    <no value>
    
    -
     .. ok
    cmd( 3):
    -
    [hello this is a beautiful world]
    
    -
     .. ok
    . ok
    -Step3:
    dvar> void:
    "- hello\n- this\n- is a\n- beautiful world\n"
    
    -
    - hello
    - this
    - is a
    - beautiful world
    
    cmd( 1):
    -
    hello
    this
    is a
    beautiful world
    
    -
     .. ok
    cmd( 2):
    -
    <no value>
    
    -
     .. ok
    cmd( 3):
    -
    [hello this is a beautiful world]
    
    -
     .. ok
    . ok
    -Step4:
    cmd( 1):
    -
    hello
    this
    is a
    beautiful world
    
    -
     .. ok
    cmd( 2):
    -
    <no value>
    
    -
     .. ok
    cmd( 3):
    -
    [hello this is a beautiful world]
    
    -
     .. ok
    . ok
    -Step5:
    dvar> void:
    "person:\n  name: tom\n  age: \"18\""
    
    -
    person:
      name: tom
      age: "18"
     WARN: [?reg a void] - [you can't register a object with void name, use a proper name instead or split to multiple steps]
    dvar[object]> void_object:
    {
      "person": {
        "age": "18",
        "name": "tom"
      }
    }
    
     WARN: [shell] - [Not implemented or void for no action!]
    . ok
    
```

##### Logs with different verbose level
* [c0086 log - verbose level v](../../logs/c0086_v)
* [c0086 log - verbose level vv](../../logs/c0086_vv)
* [c0086 log - verbose level vvv](../../logs/c0086_vvv)
* [c0086 log - verbose level vvvv](../../logs/c0086_vvvv)
* [c0086 log - verbose level vvvvv](../../logs/c0086_vvvvv)

##### References
* [Related Chapter](../../dvars/c0086)
