---
title: "c0090_vv"
date: 2020-08-09T01:36:12+88:00
draft: false
weight: 10901

---

### Log reference: <no value>

```
    loading [Config]:  ./tests/functests/upconfig.yml
    Main config:
                 Version -> 1.0.0
                  RefDir -> ./tests/functests
                 WorkDir -> cwd
              AbsWorkDir -> /up_project/up
                TaskFile -> c0090
                 Verbose -> vv
              ModuleName -> self
               ShellType -> /bin/sh
           MaxCallLayers -> 8
                 Timeout -> 3600000
     MaxModuelCallLayers -> 256
    work dir: /up_project/up
    -exec task: task
    loading [Task]:  ./tests/functests/c0090
    module: [self], instance id: [dev], exec profile: []
    Task1: [task ==> task:  ]
    -Step1: [wrong_usage: note that you can't access loopitem in dvar processing in curent func
    you can only access loopitem in dvar processing when it is called as callee, as corret_usage shows
    however you can access loopitem in do action
     ]
    dvar> person:
    "None"
    
    -
    None
    ~SubStep1: [print:  ]
    loopitme could be accessed here: tom
    
    ~SubStep1: [print:  ]
    loopitme could be accessed here: peter
    
    ~SubStep1: [print:  ]
    loopitme could be accessed here: james
    
    -Step2: [corret_usage:  ]
    =Task3: [task ==> task_callee2:  ]
    --Step1:
    dvar> person:
    "tom"
    
    -
    tom
    ~~SubStep1: [print: as explained, this should be <no value> ]
    callee2: tom
    ~~SubStep2: [print: this will be the loopitem from parent caller's
    var space and this is design
     ]
    callee2: tom
    ~~SubStep3: [print:  ]
    callee2: <no value>
    ~~SubStep4: [print:  ]
    taskvar: taskvar
    =Task3: [task ==> task_callee2:  ]
    --Step1:
    dvar> person:
    "peter"
    
    -
    peter
    ~~SubStep1: [print: as explained, this should be <no value> ]
    callee2: peter
    ~~SubStep2: [print: this will be the loopitem from parent caller's
    var space and this is design
     ]
    callee2: peter
    ~~SubStep3: [print:  ]
    callee2: <no value>
    ~~SubStep4: [print:  ]
    taskvar: taskvar
    =Task3: [task ==> task_callee2:  ]
    --Step1:
    dvar> person:
    "james"
    
    -
    james
    ~~SubStep1: [print: as explained, this should be <no value> ]
    callee2: james
    ~~SubStep2: [print: this will be the loopitem from parent caller's
    var space and this is design
     ]
    callee2: james
    ~~SubStep3: [print:  ]
    callee2: <no value>
    ~~SubStep4: [print:  ]
    taskvar: taskvar
    
```

##### Logs with different verbose level
* [c0090 log - verbose level v](../../logs/c0090_v)
* [c0090 log - verbose level vv](../../logs/c0090_vv)
* [c0090 log - verbose level vvv](../../logs/c0090_vvv)
* [c0090 log - verbose level vvvv](../../logs/c0090_vvvv)
* [c0090 log - verbose level vvvvv](../../logs/c0090_vvvvv)

##### References
* [Related Chapter](../../loop/c0090)
